Revit 2027 API
ColorFillScheme.IsByRange Property
 Represents if the parameter values in entries are treated as value range or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsByRange { get; set; }
Public Property IsByRange As Boolean
	Get
	Set
public:
property bool IsByRange {
	bool get ();
	void set (bool value);
}
member IsByRange : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The scheme entries cannot be explained by range.
Remarks
Notes:
Only numeric parameter values could be treated as by range.
There will exist at least two entries if the scheme is by range, and the first entry value should be always Int.MinValue or -Double.MaxValue.
The entries will always be sorted by ascending in the scheme if it is by range.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace